answers = [
  # Положительные
  "Бесспорно",
  "Предрешено",
  "Никаких сомнений",
  "Определённо да",
  "Можешь быть уверен в этом",

  # Нерешительно положительные
  "Мне кажется — «да»",
  "Вероятнее всего",
  "Хорошие перспективы",
  "Знаки говорят — «да»",
  "Да",

  # Нейтральные
  "Пока не ясно, попробуй снова",
  "Спроси позже",
  "Лучше не рассказывать",
  "Сейчас нельзя предсказать",
  "Сконцентрируйся и спроси опять",

  # Отрицательные
  "Даже не думай",
  "Мой ответ — «нет»",
  "По моим данным — «нет»",
  "Перспективы не очень хорошие",
  "Весьма сомнительно"
]

greetings = [
  "Здравствуй незнакомец, вот ответ на твой вопрос:\n\n",
  "Я приветствую тебя о несчастный, и отвечаю на твои мольбы:\n\n",
  "Да, великий господин, я подскажу тебе:\n\n",
  "Трепещи неверный, ты получишь ответ от меня:\n\n",
  "Ты испытываешь мое терпение земное существо:\n\n",
  "Костяной мешок, вот твой ответ:\n\n"
]
puts greetings.sample
sleep 2
puts answers.sample
